app/controllers/tasks_controller.rb

  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]

  def create
    @task = Task.new(task_params)

    if @task.save
---
INSERT INTO "tasks" ("action", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["action", "Wake up"], ["description", "screaming out loud"], ["created_at", "2018-09-24 13:57:34.272055"], ["updated_at", "2018-09-24 13:57:34.272055"]]

    task = Task.find(params[:id])

    if task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
UPDATE "tasks" SET "action" = $1, "description" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["action", "jknbhujnk"], ["description", "kkkkkkkkkkkkkk"], ["updated_at", "2018-09-28 01:59:14.503291"], ["id", 53]]

    task = Task.find(params[:id])

    task.update(
      completion_date: DateTime.current.to_date
    )
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", "2018-09-24"], ["updated_at", "2018-09-24 13:58:16.924936"], ["id", 50]]

  def destroy_all
    Task.where.not(completion_date: nil).destroy_all
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 50]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."completion_date" IS NOT NULL